In [18]:
import pandas as pd
import numpy as np

In [32]:
np.random.seed(0)
left = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value': np.random.randn(4)})    
right = pd.DataFrame({'key': ['B', 'D', 'E', 'F'], 'value': np.random.randn(4)})

****

# INNER

![inner](images/YvuOa.png)

* A área **azul** indicam as linhas que estarão presentes do retorno da função merge;
* A área em **vermelho** indicam as linhas que serão excluídas do retorno da função merge;
* A área em **verde** indicam valores faltantes (missing values) que serão substituídos por NaN's no retorno da função merge.

In [33]:
left

  key     value
0   A  1.764052
1   B  0.400157
2   C  0.978738
3   D  2.240893

In [34]:
right

  key     value
0   B  1.867558
1   D -0.977278
2   E  0.950088
3   F -0.151357

### Como usar

In [43]:
left.merge(right, on='key', how='inner', suffixes=['_left', '_right'])

  key  value_left  value_right
0   B    0.400157     1.867558
1   D    2.240893    -0.977278

Dessa forma somente linhas do dataframe left (esquerda) e right (direita) que compartilham valores da coluna 'key' em comum aparecerão no dataframe retornado pela função merge.

# LEFT

![left](images/BECid.png)

In [39]:
left

  key     value
0   A  1.764052
1   B  0.400157
2   C  0.978738
3   D  2.240893

In [40]:
right

  key     value
0   B  1.867558
1   D -0.977278
2   E  0.950088
3   F -0.151357

### Como usar

In [44]:
left.merge(right, on='key', how='left', suffixes=['_left', '_right'])

  key  value_left  value_right
0   A    1.764052          NaN
1   B    0.400157     1.867558
2   C    0.978738          NaN
3   D    2.240893    -0.977278

Note a inserção de NaN's neste caso. Especificando o parâmetro how='left' (direita), somente chaves (keys) do dataframe 'left' serão usados, e linhas 'missing' do datafrane 'right' serão preenchidas com NaN.

Neste caso a 'key' com valor 'C' presente no dataframe 'left' não está no dataframe 'right', sendo assim, o valor NaN é usado para preencher o dataframe mergeado.

# Right

![right](images/8w1US.png)

In [45]:
left

  key     value
0   A  1.764052
1   B  0.400157
2   C  0.978738
3   D  2.240893

In [46]:
right

  key     value
0   B  1.867558
1   D -0.977278
2   E  0.950088
3   F -0.151357

In [47]:
left.merge(right, on='key', how='right', suffixes=['_left', '_right'])

  key  value_left  value_right
0   B    0.400157     1.867558
1   D    2.240893    -0.977278
2   E         NaN     0.950088
3   F         NaN    -0.151357

Com how='right' somente chaves (keys) do dataframe de 'right' são usados, valores faltantes do dataframe 'left' são substituidos por NaN.

Neste caso as chaves 'E' e 'F' presentes no dataframe 'right', não estão presentes em 'left'.

# OUTER

![outer](images/euLoe.png)

Especificando how='outer' o método merge() usa as chaves (keys) de ambos os dataframes e NaN's são inseridos onde há valores faltantes (missing).

In [48]:
left.merge(right, on='key', how='outer', suffixes=['_left', '_right'])

  key  value_left  value_right
0   A    1.764052          NaN
1   B    0.400157     1.867558
2   C    0.978738          NaN
3   D    2.240893    -0.977278
4   E         NaN     0.950088
5   F         NaN    -0.151357